schedule.md
---
layout: page
title: Schedule
permalink: /schedule/
---
<script src="https://code.jquery.com/jquery-3.1.1.js"
        integrity="sha256-16cdPddA6VdVInumRGo6IbivbERE8p7CQR3HzTBuELA="
        crossorigin="anonymous"></script>

<script>
 $(document).ready(function(){
     $('td:contains("Pset")').closest('tr').css('background-color','LemonChiffon');
     $('td:contains("exam")').closest('tr').css('background-color','LightSalmon');
 });
</script>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 6</td>
<td class="org-left">overview and simple perceptron</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 8</td>
<td class="org-left">delta rule</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 13</td>
<td class="org-left">multilayer perceptrons</td>
</tr>

<tr>
<td class="org-left">Pset 1 due</td>
<td class="org-left">Feb. 15</td>
<td class="org-left">simple perceptrons</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 15</td>
<td class="org-left">backpropagation</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 20</td>
<td class="org-left">stochastic gradient descent</td>
</tr>

<tr>
<td class="org-left">Pset 2 due</td>
<td class="org-left">Feb. 22</td>
<td class="org-left">multilayer perceptrons</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 22</td>
<td class="org-left">generalization and regularization</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Feb. 27</td>
<td class="org-left">convolution and pooling</td>
</tr>

<tr>
<td class="org-left">Pset 3 due</td>
<td class="org-left">Mar. 1</td>
<td class="org-left">black art of backprop</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 1</td>
<td class="org-left">ConvNet backprop</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 6</td>
<td class="org-left">visual object recognition</td>
</tr>

<tr>
<td class="org-left">Pset 4 due</td>
<td class="org-left">Mar. 8</td>
<td class="org-left">LeNet</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 8</td>
<td class="org-left">biological vision</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 13</td>
<td class="org-left">midterm review</td>
</tr>

<tr>
<td class="org-left">Midterm</td>
<td class="org-left">Mar. 15</td>
<td class="org-left">in-class exam</td>
</tr>

<tr>
<td class="org-left">Spring break</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 27</td>
<td class="org-left">deconvolution and other primitives</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Mar. 29</td>
<td class="org-left">image segmentation</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 3</td>
<td class="org-left">competitive learning and clustering</td>
</tr>

<tr>
<td class="org-left">Pset 5 due</td>
<td class="org-left">Apr. 5</td>
<td class="org-left">dense prediction on images</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 5</td>
<td class="org-left">principal component analysis</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 10</td>
<td class="org-left">autoencoders</td>
</tr>

<tr>
<td class="org-left">Pset 6 due</td>
<td class="org-left">Apr. 12</td>
<td class="org-left">unsupervised learning</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 12</td>
<td class="org-left">n-grams and word embeddings</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 17</td>
<td class="org-left">backprop through time</td>
</tr>

<tr>
<td class="org-left">Pset 7 due</td>
<td class="org-left">Apr. 19</td>
<td class="org-left">word embeddings</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 19</td>
<td class="org-left">RNNs for language</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 24</td>
<td class="org-left">policy gradient</td>
</tr>

<tr>
<td class="org-left">Pset 8 due</td>
<td class="org-left">Apr. 26</td>
<td class="org-left">language modeling</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">Apr. 26</td>
<td class="org-left">Markov decision processes</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">May 1</td>
<td class="org-left">value iteration</td>
</tr>

<tr>
<td class="org-left">Pset 9 due</td>
<td class="org-left">May 3</td>
<td class="org-left">reinforcement learning</td>
</tr>

<tr>
<td class="org-left">Lecture</td>
<td class="org-left">May 3</td>
<td class="org-left">final review</td>
</tr>

<tr>
<td class="org-left">Final</td>
<td class="org-left">TBA</td>
<td class="org-left">final exam</td>
</tr>
</tbody>
</table>
